import os

# =============================================
# НАСТРОЙКИ БОТА
# =============================================

# Токен бота от @BotFather
BOT_TOKEN = os.getenv("8304285302:AAERrfJltwn_Rq-7VWdp--F6Rw-gm3sHvmM")

# ID администраторов (можно добавить несколько)
# Узнать свой ID можно у бота @userinfobot
ADMIN_IDS = [
    8392734804,  # Замените на ваш Telegram ID
    # 987654321,  # Можно добавить ещё администраторов
]

# =============================================
# ПРЕДМЕТЫ
# =============================================

SUBJECTS = [
    "Алгебра",
    "Биология",
    "ВиС",
    "География",
    "Геометрия",
    "Английский язык (группа 1)",
    "Английский язык (группа 2)",
    "Информатика",
    "История",
    "Литература",
    "Обществознание",
    "Русский язык",
    "Физика",
    "Химия",
]

# Короткие ключи для базы данных
SUBJECT_KEYS = {
    "Алгебра": "algebra",
    "Биология": "biology",
    "ВиС": "vis",
    "География": "geography",
    "Геометрия": "geometry",
    "Английский язык (группа 1)": "english_1",
    "Английский язык (группа 2)": "english_2",
    "Информатика": "informatics",
    "История": "history",
    "Литература": "literature",
    "Обществознание": "social",
    "Русский язык": "russian",
    "Физика": "physics",
    "Химия": "chemistry",
}
